app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "h"], ["created_at", Tue, 04 Aug 2015 13:07:42 UTC +00:00], ["title", "h"], ["updated_at", Tue, 04 Aug 2015 13:07:42 UTC +00:00], ["user_id", 1]]
---
    def create
		@micropost = current_user.microposts.build(params[:micropost])
		if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]
---
    def edit
		@micropost = Micropost.find(params[:id])

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "microposts" SET "title" = 'sadfd', "updated_at" = '2015-08-04 15:18:05.985238' WHERE "microposts"."id" = 1
---
	def update
		@micropost = Micropost.find(params[:id])
	    if @micropost.update_attributes(params[:micropost])