app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'me', "password_digest" = '$2a$10$6VI3tPQF7zEOmi.CgTsKtenfxWxdt46KBpbMWtDzY4feklX3NqCcK', "remember_token" = 'y_GnGZ1OhhimR_Qn8uyT_Q', "updated_at" = '2015-08-03 19:26:14.081749' WHERE "users"."id" = 1